MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2431/mcu.h
// Register: PCL
#define PCL PCL
extern volatile unsigned char           PCL                 __at(0xFF9);
#ifndef _LIB_BUILD
asm("PCL equ 0FF9h");
#endif

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0xFFA);
#ifndef _LIB_BUILD
asm("PCLATH equ 0FFAh");
#endif

// Register: PCLATU
#define PCLATU PCLATU
extern volatile unsigned char           PCLATU              __at(0xFFB);
#ifndef _LIB_BUILD
asm("PCLATU equ 0FFBh");
#endif

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0xFFC);
#ifndef _LIB_BUILD
asm("STKPTR equ 0FFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR                 :5;
        unsigned                        :1;
        unsigned STKUNF                 :1;
        unsigned STKFUL                 :1;
    };
    struct {
        unsigned STKPTR0                :1;
        unsigned STKPTR1                :1;
        unsigned STKPTR2                :1;
        unsigned STKPTR3                :1;
        unsigned STKPTR4                :1;
        unsigned                        :2;
        unsigned STKOVF                 :1;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0xFFC);
// bitfield macros
#define _STKPTR_STKPTR_POSN                                 0x0
#define _STKPTR_STKPTR_POSITION                             0x0
#define _STKPTR_STKPTR_SIZE                                 0x5
#define _STKPTR_STKPTR_LENGTH                               0x5
#define _STKPTR_STKPTR_MASK                                 0x1F
#define _STKPTR_STKUNF_POSN                                 0x6
#define _STKPTR_STKUNF_POSITION                             0x6
#define _STKPTR_STKUNF_SIZE                                 0x1
#define _STKPTR_STKUNF_LENGTH                               0x1
#define _STKPTR_STKUNF_MASK                                 0x40
#define _STKPTR_STKFUL_POSN                                 0x7
#define _STKPTR_STKFUL_POSITION                             0x7
#define _STKPTR_STKFUL_SIZE                                 0x1
#define _STKPTR_STKFUL_LENGTH                               0x1
#define _STKPTR_STKFUL_MASK                                 0x80
#define _STKPTR_STKPTR0_POSN                                0x0
#define _STKPTR_STKPTR0_POSITION                            0x0
#define _STKPTR_STKPTR0_SIZE                                0x1
#define _STKPTR_STKPTR0_LENGTH                              0x1
#define _STKPTR_STKPTR0_MASK                                0x1
#define _STKPTR_STKPTR1_POSN                                0x1
#define _STKPTR_STKPTR1_POSITION                            0x1
#define _STKPTR_STKPTR1_SIZE                                0x1
#define _STKPTR_STKPTR1_LENGTH                              0x1
#define _STKPTR_STKPTR1_MASK                                0x2
#define _STKPTR_STKPTR2_POSN                                0x2
#define _STKPTR_STKPTR2_POSITION                            0x2
#define _STKPTR_STKPTR2_SIZE                                0x1
#define _STKPTR_STKPTR2_LENGTH                              0x1
#define _STKPTR_STKPTR2_MASK                                0x4
#define _STKPTR_STKPTR3_POSN                                0x3
#define _STKPTR_STKPTR3_POSITION                            0x3
#define _STKPTR_STKPTR3_SIZE                                0x1
#define _STKPTR_STKPTR3_LENGTH                              0x1
#define _STKPTR_STKPTR3_MASK                                0x8
#define _STKPTR_STKPTR4_POSN                                0x4
#define _STKPTR_STKPTR4_POSITION                            0x4
#define _STKPTR_STKPTR4_SIZE                                0x1
#define _STKPTR_STKPTR4_LENGTH                              0x1
#define _STKPTR_STKPTR4_MASK                                0x10
#define _STKPTR_STKOVF_POSN                                 0x7
#define _STKPTR_STKOVF_POSITION                             0x7
#define _STKPTR_STKOVF_SIZE                                 0x1
#define _STKPTR_STKOVF_LENGTH                               0x1
#define _STKPTR_STKOVF_MASK                                 0x80

// Register: TOS
#define TOS TOS
#ifndef __CCI__
extern volatile __uint24                TOS                 __at(0xFFD);
#endif
#ifndef _LIB_BUILD
asm("TOS equ 0FFDh");
#endif

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON<ABDEN>
extern volatile __bit                   ABDEN               __at(0x7D50);	// @ (0xFAA * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON,0)
// BAUDCON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0x7D57);	// @ (0xFAA * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUDCON,7)
// ADCON0<ACMOD0>
extern volatile __bit                   ACMOD0              __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 ACMOD0_bit          _BIT_ACCESS(ADCON0,2)
// ADCON0<ACMOD1>
extern volatile __bit                   ACMOD1              __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 ACMOD1_bit          _BIT_ACCESS(ADCON0,3)
// ADCON0<ACONV>
extern volatile __bit                   ACONV               __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 ACONV_bit           _BIT_ACCESS(ADCON0,5)
// ADCON2<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON2,3)
// ADCON2<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON2,4)
// ADCON2<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON2,5)
// ADCON2<ACQT3>
extern volatile __bit                   ACQT3               __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 ACQT3_bit           _BIT_ACCESS(ADCON2,6)
// ADCON0<ACSCH>
extern volatile __bit                   ACSCH               __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 ACSCH_bit           _BIT_ACCESS(ADCON0,4)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA,3)
// RCSTA<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPNT0>
extern volatile __bit                   ADPNT0              __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 ADPNT0_bit          _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPNT1>
extern volatile __bit                   ADPNT1              __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 ADPNT1_bit          _BIT_ACCESS(ADCON1,1)
// ADCON3<ADRS0>
extern volatile __bit                   ADRS0               __at(0x7CD6);	// @ (0xF9A * 8 + 6)
#define                                 ADRS0_bit           _BIT_ACCESS(ADCON3,6)
// ADCON3<ADRS1>
extern volatile __bit                   ADRS1               __at(0x7CD7);	// @ (0xF9A * 8 + 7)
#define                                 ADRS1_bit           _BIT_ACCESS(ADCON3,7)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,4)
// ANSEL0<ANS0>
extern volatile __bit                   ANS0                __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL0,0)
// ANSEL0<ANS1>
extern volatile __bit                   ANS1                __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL0,1)
// ANSEL0<ANS2>
extern volatile __bit                   ANS2                __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL0,2)
// ANSEL0<ANS3>
extern volatile __bit                   ANS3                __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL0,3)
// ANSEL0<ANS4>
extern volatile __bit                   ANS4                __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 ANS4_bit            _BIT_ACCESS(ANSEL0,4)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// ADCON1<BFEMT>
extern volatile __bit                   BFEMT               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 BFEMT_bit           _BIT_ACCESS(ADCON1,3)
// ADCON1<BFOVFL>
extern volatile __bit                   BFOVFL              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 BFOVFL_bit          _BIT_ACCESS(ADCON1,2)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// FLTCONFIG<BRFEN>
extern volatile __bit                   BRFEN               __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 BRFEN_bit           _BIT_ACCESS(FLTCONFIG,7)
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON,3)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// TXSTA<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA,2)
// CAP1CON<CAP1M0>
extern volatile __bit                   CAP1M0              __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 CAP1M0_bit          _BIT_ACCESS(CAP1CON,0)
// CAP1CON<CAP1M1>
extern volatile __bit                   CAP1M1              __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 CAP1M1_bit          _BIT_ACCESS(CAP1CON,1)
// CAP1CON<CAP1M2>
extern volatile __bit                   CAP1M2              __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 CAP1M2_bit          _BIT_ACCESS(CAP1CON,2)
// CAP1CON<CAP1M3>
extern volatile __bit                   CAP1M3              __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 CAP1M3_bit          _BIT_ACCESS(CAP1CON,3)
// CAP1CON<CAP1REN>
extern volatile __bit                   CAP1REN             __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 CAP1REN_bit         _BIT_ACCESS(CAP1CON,6)
// CAP1CON<CAP1TMR>
extern volatile __bit                   CAP1TMR             __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 CAP1TMR_bit         _BIT_ACCESS(CAP1CON,5)
// CAP2CON<CAP2M0>
extern volatile __bit                   CAP2M0              __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 CAP2M0_bit          _BIT_ACCESS(CAP2CON,0)
// CAP2CON<CAP2M1>
extern volatile __bit                   CAP2M1              __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 CAP2M1_bit          _BIT_ACCESS(CAP2CON,1)
// CAP2CON<CAP2M2>
extern volatile __bit                   CAP2M2              __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 CAP2M2_bit          _BIT_ACCESS(CAP2CON,2)
// CAP2CON<CAP2M3>
extern volatile __bit                   CAP2M3              __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 CAP2M3_bit          _BIT_ACCESS(CAP2CON,3)
// CAP2CON<CAP2REN>
extern volatile __bit                   CAP2REN             __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 CAP2REN_bit         _BIT_ACCESS(CAP2CON,6)
// CAP2CON<CAP2TMR>
extern volatile __bit                   CAP2TMR             __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 CAP2TMR_bit         _BIT_ACCESS(CAP2CON,5)
// CAP3CON<CAP3M0>
extern volatile __bit                   CAP3M0              __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 CAP3M0_bit          _BIT_ACCESS(CAP3CON,0)
// CAP3CON<CAP3M1>
extern volatile __bit                   CAP3M1              __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 CAP3M1_bit          _BIT_ACCESS(CAP3CON,1)
// CAP3CON<CAP3M2>
extern volatile __bit                   CAP3M2              __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 CAP3M2_bit          _BIT_ACCESS(CAP3CON,2)
// CAP3CON<CAP3M3>
extern volatile __bit                   CAP3M3              __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 CAP3M3_bit          _BIT_ACCESS(CAP3CON,3)
// CAP3CON<CAP3REN>
extern volatile __bit                   CAP3REN             __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 CAP3REN_bit         _BIT_ACCESS(CAP3CON,6)
// CAP3CON<CAP3TMR>
extern volatile __bit                   CAP3TMR             __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 CAP3TMR_bit         _BIT_ACCESS(CAP3CON,5)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// TXSTA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA,7)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
